; ModuleID = 'grep-2.9/src/grep.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.matcher = type { i8*, void (i8*, i64)*, i64 (i8*, i64, i64*, i8*)* }
%struct.patterns = type { %struct.re_pattern_buffer, %struct.re_registers }
%struct.re_pattern_buffer = type { i8*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_registers = type { i32, i32*, i32* }
%struct.dfa = type { [8 x i32]*, i32, i32, i32*, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32*, %struct.mb_char_classes*, i32, i32, %struct.dfa_state*, i32, i32, %struct.position_set*, i32, i32, i32, i32**, i32**, i32**, i32*, i32*, %struct.dfamust* }
%struct.mb_char_classes = type { i32, i32, i32*, i32, i64*, i32, i32*, i32*, i32, i8**, i32, i8**, i32 }
%struct.dfa_state = type { i32, %struct.position_set, i8, i8, i8, i8, i32, %struct.position_set }
%struct.position_set = type { %struct.position*, i32 }
%struct.position = type { i32, i32 }
%struct.dfamust = type { i32, i8*, %struct.dfamust* }
%struct.kwset = type { %struct.obstack, i32, %struct.trie*, i32, i32, [256 x i8], [256 x %struct.trie*], i8*, i32, i8* }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon.3, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%union.anon.3 = type { i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "matchers", scope: !2, file: !3, line: 22, type: !20, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !7)
!3 = !DIFile(filename: "grep.c", directory: "/vagrant/grep-2.9/src")
!4 = !{}
!5 = !{!6}
!6 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!7 = !{!0, !8, !15}
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "before_options", scope: !2, file: !3, line: 31, type: !10, isLocal: false, isDefinition: true)
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 472, elements: !13)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !{!14}
!14 = !DISubrange(count: 59)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "after_options", scope: !2, file: !3, line: 33, type: !17, isLocal: false, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 912, elements: !18)
!18 = !{!19}
!19 = !DISubrange(count: 114)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1152, elements: !40)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "matcher", file: !23, line: 33, size: 192, elements: !24)
!23 = !DIFile(filename: "./grep.h", directory: "/vagrant/grep-2.9/src")
!24 = !{!25, !27, !34}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !22, file: !23, line: 35, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "compile", scope: !22, file: !23, line: 36, baseType: !28, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "compile_fp_t", file: !23, line: 28, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{null, !26, !32}
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !33, line: 62, baseType: !6)
!33 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.0/include/stddef.h", directory: "/vagrant/grep-2.9/src")
!34 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !22, file: !23, line: 37, baseType: !35, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "execute_fp_t", file: !23, line: 29, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!32, !26, !32, !39, !26}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!40 = !{!41}
!41 = !DISubrange(count: 6)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "mode", scope: !44, file: !45, line: 64, type: !54, isLocal: true, isDefinition: true)
!44 = distinct !DISubprogram(name: "dfawarn", scope: !45, file: !45, line: 62, type: !46, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, unit: !48, variables: !180)
!45 = !DIFile(filename: "dfasearch.c", directory: "/vagrant/grep-2.9/src")
!46 = !DISubroutineType(types: !47)
!47 = !{null, !26}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !74, globals: !80)
!49 = !{!50, !54, !59}
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 47, size: 32, elements: !52)
!51 = !DIFile(filename: "./system.h", directory: "/vagrant/grep-2.9/src")
!52 = !{!53}
!53 = !DIEnumerator(name: "EXIT_TROUBLE", value: 2)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !44, file: !45, line: 64, size: 32, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIEnumerator(name: "DW_NONE", value: 0)
!57 = !DIEnumerator(name: "DW_POSIX", value: 1)
!58 = !DIEnumerator(name: "DW_GNU", value: 2)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 46, size: 32, elements: !61)
!60 = !DIFile(filename: "/usr/include/ctype.h", directory: "/vagrant/grep-2.9/src")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!62 = !DIEnumerator(name: "_ISupper", value: 256)
!63 = !DIEnumerator(name: "_ISlower", value: 512)
!64 = !DIEnumerator(name: "_ISalpha", value: 1024)
!65 = !DIEnumerator(name: "_ISdigit", value: 2048)
!66 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!67 = !DIEnumerator(name: "_ISspace", value: 8192)
!68 = !DIEnumerator(name: "_ISprint", value: 16384)
!69 = !DIEnumerator(name: "_ISgraph", value: 32768)
!70 = !DIEnumerator(name: "_ISblank", value: 1)
!71 = !DIEnumerator(name: "_IScntrl", value: 2)
!72 = !DIEnumerator(name: "_ISpunct", value: 4)
!73 = !DIEnumerator(name: "_ISalnum", value: 8)
!74 = !{!6, !75, !32, !76, !77, !78, !79}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!77 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!78 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!79 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!80 = !{!42, !81, !106, !108, !113, !115, !120, !122, !127, !129, !135, !140, !173, !176, !178}
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "line_beg_no_bk", scope: !83, file: !45, line: 182, type: !103, isLocal: true, isDefinition: true)
!83 = distinct !DISubprogram(name: "GEAcompile", scope: !45, file: !45, line: 132, type: !84, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !48, variables: !88)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !26, !32, !86}
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !87, line: 96, baseType: !6)
!87 = !DIFile(filename: "../lib/regex.h", directory: "/vagrant/grep-2.9/src")
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !99, !102}
!89 = !DILocalVariable(name: "pattern", arg: 1, scope: !83, file: !45, line: 132, type: !26)
!90 = !DILocalVariable(name: "size", arg: 2, scope: !83, file: !45, line: 132, type: !32)
!91 = !DILocalVariable(name: "syntax_bits", arg: 3, scope: !83, file: !45, line: 132, type: !86)
!92 = !DILocalVariable(name: "err", scope: !83, file: !45, line: 134, type: !26)
!93 = !DILocalVariable(name: "p", scope: !83, file: !45, line: 135, type: !26)
!94 = !DILocalVariable(name: "sep", scope: !83, file: !45, line: 135, type: !26)
!95 = !DILocalVariable(name: "total", scope: !83, file: !45, line: 136, type: !32)
!96 = !DILocalVariable(name: "motif", scope: !83, file: !45, line: 137, type: !76)
!97 = !DILocalVariable(name: "len", scope: !98, file: !45, line: 151, type: !32)
!98 = distinct !DILexicalBlock(scope: !83, file: !45, line: 150, column: 5)
!99 = !DILocalVariable(name: "bk", scope: !100, file: !45, line: 190, type: !77)
!100 = distinct !DILexicalBlock(scope: !101, file: !45, line: 181, column: 5)
!101 = distinct !DILexicalBlock(scope: !83, file: !45, line: 180, column: 7)
!102 = !DILocalVariable(name: "n", scope: !100, file: !45, line: 191, type: !76)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 24, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 3)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "line_end_no_bk", scope: !83, file: !45, line: 183, type: !103, isLocal: true, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "word_beg_no_bk", scope: !83, file: !45, line: 184, type: !110, isLocal: true, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 152, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 19)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "word_end_no_bk", scope: !83, file: !45, line: 185, type: !110, isLocal: true, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "line_beg_bk", scope: !83, file: !45, line: 186, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 32, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 4)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "line_end_bk", scope: !83, file: !45, line: 187, type: !117, isLocal: true, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "word_beg_bk", scope: !83, file: !45, line: 188, type: !124, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 184, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 23)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "word_end_bk", scope: !83, file: !45, line: 189, type: !124, isLocal: true, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "kwset", scope: !48, file: !45, line: 31, type: !131, isLocal: true, isDefinition: true)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "kwset_t", file: !132, line: 34, baseType: !133)
!132 = !DIFile(filename: "./kwset.h", directory: "/vagrant/grep-2.9/src")
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "kwset", file: !132, line: 33, flags: DIFlagFwdDecl)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "dfa", scope: !48, file: !45, line: 34, type: !137, isLocal: true, isDefinition: true)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "dfa", file: !139, line: 35, flags: DIFlagFwdDecl)
!139 = !DIFile(filename: "./dfa.h", directory: "/vagrant/grep-2.9/src")
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "patterns0", scope: !48, file: !45, line: 43, type: !142, isLocal: true, isDefinition: true)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "patterns", file: !45, line: 37, size: 704, elements: !143)
!143 = !{!144, !164}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "regexbuf", scope: !142, file: !45, line: 40, baseType: !145, size: 512)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !87, line: 452, size: 512, elements: !146)
!146 = !{!147, !149, !151, !152, !153, !154, !155, !156, !158, !159, !160, !161, !162, !163}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !145, file: !87, line: 457, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !145, file: !87, line: 460, baseType: !150, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !87, line: 80, baseType: !6)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !145, file: !87, line: 463, baseType: !150, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !145, file: !87, line: 466, baseType: !86, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !145, file: !87, line: 471, baseType: !76, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !145, file: !87, line: 477, baseType: !148, size: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !145, file: !87, line: 480, baseType: !32, size: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !145, file: !87, line: 486, baseType: !157, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!157 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !145, file: !87, line: 497, baseType: !157, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !145, file: !87, line: 501, baseType: !157, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !145, file: !87, line: 505, baseType: !157, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !145, file: !87, line: 509, baseType: !157, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !145, file: !87, line: 512, baseType: !157, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !145, file: !87, line: 515, baseType: !157, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !142, file: !45, line: 41, baseType: !165, size: 192, offset: 512)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_registers", file: !87, line: 524, size: 192, elements: !166)
!166 = !{!167, !169, !172}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "num_regs", scope: !165, file: !87, line: 526, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !87, line: 79, baseType: !157)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !165, file: !87, line: 527, baseType: !170, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !87, line: 77, baseType: !77)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !165, file: !87, line: 528, baseType: !170, size: 64, offset: 128)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "patterns", scope: !48, file: !45, line: 45, type: !175, isLocal: true, isDefinition: true)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "pcount", scope: !48, file: !45, line: 46, type: !32, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "kwset_exact_matches", scope: !48, file: !45, line: 74, type: !77, isLocal: true, isDefinition: true)
!180 = !{!181}
!181 = !DILocalVariable(name: "mesg", arg: 1, scope: !44, file: !45, line: 62, type: !26)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "kwset", scope: !184, file: !185, line: 30, type: !131, isLocal: true, isDefinition: true)
!184 = distinct !DICompileUnit(language: DW_LANG_C99, file: !185, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !186, retainedTypes: !187, globals: !188)
!185 = !DIFile(filename: "kwsearch.c", directory: "/vagrant/grep-2.9/src")
!186 = !{!50, !59}
!187 = !{!75, !32, !77, !78, !79}
!188 = !{!182}
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "cre", scope: !191, file: !192, line: 31, type: !214, isLocal: true, isDefinition: true)
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !193, retainedTypes: !194, globals: !195)
!192 = !DIFile(filename: "pcresearch.c", directory: "/vagrant/grep-2.9/src")
!193 = !{!50}
!194 = !{!75, !32}
!195 = !{!189, !196}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "extra", scope: !191, file: !192, line: 34, type: !198, isLocal: true, isDefinition: true)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcre_extra", file: !200, line: 385, baseType: !201)
!200 = !DIFile(filename: "/usr/include/pcre.h", directory: "/vagrant/grep-2.9/src")
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcre_extra", file: !200, line: 376, size: 512, elements: !202)
!202 = !{!203, !204, !205, !206, !207, !210, !211, !213}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !201, file: !200, line: 377, baseType: !6, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "study_data", scope: !201, file: !200, line: 378, baseType: !75, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "match_limit", scope: !201, file: !200, line: 379, baseType: !6, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "callout_data", scope: !201, file: !200, line: 380, baseType: !75, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tables", scope: !201, file: !200, line: 381, baseType: !208, size: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "match_limit_recursion", scope: !201, file: !200, line: 382, baseType: !6, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !201, file: !200, line: 383, baseType: !212, size: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "executable_jit", scope: !201, file: !200, line: 384, baseType: !75, size: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcre", file: !200, line: 325, baseType: !216)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_pcre", file: !200, line: 324, flags: DIFlagFwdDecl)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "eolbyte", scope: !219, file: !220, line: 354, type: !78, isLocal: false, isDefinition: true)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !221, retainedTypes: !244, globals: !252)
!220 = !DIFile(filename: "main.c", directory: "/vagrant/grep-2.9/src")
!221 = !{!50, !222, !226, !231, !236}
!222 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !220, line: 382, size: 32, elements: !223)
!223 = !{!224, !225}
!224 = !DIEnumerator(name: "READ_DEVICES", value: 0)
!225 = !DIEnumerator(name: "SKIP_DEVICES", value: 1)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !220, line: 571, size: 32, elements: !227)
!227 = !{!228, !229, !230}
!228 = !DIEnumerator(name: "BINARY_BINARY_FILES", value: 0)
!229 = !DIEnumerator(name: "TEXT_BINARY_FILES", value: 1)
!230 = !DIEnumerator(name: "WITHOUT_MATCH_BINARY_FILES", value: 2)
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "directories_type", file: !220, line: 361, size: 32, elements: !232)
!232 = !{!233, !234, !235}
!233 = !DIEnumerator(name: "READ_DIRECTORIES", value: 2)
!234 = !DIEnumerator(name: "RECURSE_DIRECTORIES", value: 3)
!235 = !DIEnumerator(name: "SKIP_DIRECTORIES", value: 4)
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !237, line: 26, size: 32, elements: !238)
!237 = !DIFile(filename: "../lib/xstrtol.h", directory: "/vagrant/grep-2.9/src")
!238 = !{!239, !240, !241, !242, !243}
!239 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!240 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!241 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!242 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!243 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!244 = !{!245, !26, !75, !76, !250, !78, !32, !251}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !246, line: 86, baseType: !247)
!246 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/vagrant/grep-2.9/src")
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !248, line: 140, baseType: !249)
!248 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/vagrant/grep-2.9/src")
!249 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!252 = !{!253, !295, !297, !299, !301, !303, !305, !307, !312, !314, !316, !318, !320, !217, !322, !324, !326, !328, !330, !332, !334, !336, !338, !340, !342, !344, !346, !348, !350, !352, !354, !356, !358, !364, !366, !385, !387, !400, !402, !406, !410, !412, !414, !416, !418, !420, !434, !436, !438, !440, !442, !444, !446, !448, !450, !452, !454, !456, !458, !460, !465, !467, !469, !471, !473, !475, !477, !501, !503, !505}
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "stats_base", scope: !219, file: !220, line: 69, type: !255, isLocal: true, isDefinition: true)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stats", file: !220, line: 62, size: 1216, elements: !256)
!256 = !{!257, !260}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !255, file: !220, line: 64, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !255, file: !220, line: 65, baseType: !261, size: 1152, offset: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !262, line: 46, size: 1152, elements: !263)
!262 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/vagrant/grep-2.9/src")
!263 = !{!264, !266, !268, !270, !272, !274, !276, !277, !278, !279, !281, !283, !291, !292, !293}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !261, file: !262, line: 48, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !248, line: 133, baseType: !6)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !261, file: !262, line: 53, baseType: !267, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !248, line: 136, baseType: !6)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !261, file: !262, line: 61, baseType: !269, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !248, line: 139, baseType: !6)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !261, file: !262, line: 62, baseType: !271, size: 32, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !248, line: 138, baseType: !157)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !261, file: !262, line: 64, baseType: !273, size: 32, offset: 224)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !248, line: 134, baseType: !157)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !261, file: !262, line: 65, baseType: !275, size: 32, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !248, line: 135, baseType: !157)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !261, file: !262, line: 67, baseType: !77, size: 32, offset: 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !261, file: !262, line: 69, baseType: !265, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !261, file: !262, line: 74, baseType: !247, size: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !261, file: !262, line: 78, baseType: !280, size: 64, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !248, line: 162, baseType: !249)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !261, file: !262, line: 80, baseType: !282, size: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !248, line: 167, baseType: !249)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !261, file: !262, line: 91, baseType: !284, size: 128, offset: 576)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !285, line: 8, size: 128, elements: !286)
!285 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "/vagrant/grep-2.9/src")
!286 = !{!287, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !284, file: !285, line: 10, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !248, line: 148, baseType: !249)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !284, file: !285, line: 11, baseType: !290, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !248, line: 184, baseType: !249)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !261, file: !262, line: 92, baseType: !284, size: 128, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !261, file: !262, line: 93, baseType: !284, size: 128, offset: 832)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !261, file: !262, line: 106, baseType: !294, size: 192, offset: 960)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 192, elements: !104)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "show_help", scope: !219, file: !220, line: 72, type: !77, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "show_version", scope: !219, file: !220, line: 75, type: !77, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "suppress_errors", scope: !219, file: !220, line: 78, type: !77, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "color_option", scope: !219, file: !220, line: 81, type: !77, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "only_matching", scope: !219, file: !220, line: 84, type: !77, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "align_tabs", scope: !219, file: !220, line: 87, type: !77, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "excluded_patterns", scope: !219, file: !220, line: 270, type: !309, isLocal: true, isDefinition: true)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "exclude", file: !311, line: 40, flags: DIFlagFwdDecl)
!311 = !DIFile(filename: "../lib/exclude.h", directory: "/vagrant/grep-2.9/src")
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "included_patterns", scope: !219, file: !220, line: 271, type: !309, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "excluded_directory_patterns", scope: !219, file: !220, line: 272, type: !309, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "match_icase", scope: !219, file: !220, line: 351, type: !77, isLocal: false, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "match_words", scope: !219, file: !220, line: 352, type: !77, isLocal: false, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "match_lines", scope: !219, file: !220, line: 353, type: !77, isLocal: false, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "errseen", scope: !219, file: !220, line: 359, type: !77, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "compile", scope: !219, file: !220, line: 394, type: !28, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "binary_files", scope: !219, file: !220, line: 576, type: !226, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "filename_mask", scope: !219, file: !220, line: 578, type: !77, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "out_quiet", scope: !219, file: !220, line: 579, type: !77, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "out_invert", scope: !219, file: !220, line: 580, type: !77, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "out_file", scope: !219, file: !220, line: 581, type: !77, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "out_line", scope: !219, file: !220, line: 582, type: !77, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "out_byte", scope: !219, file: !220, line: 583, type: !77, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "out_before", scope: !219, file: !220, line: 584, type: !77, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "out_after", scope: !219, file: !220, line: 585, type: !77, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "count_matches", scope: !219, file: !220, line: 586, type: !77, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "list_files", scope: !219, file: !220, line: 587, type: !77, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "no_filenames", scope: !219, file: !220, line: 588, type: !77, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "max_count", scope: !219, file: !220, line: 589, type: !245, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "line_buffered", scope: !219, file: !220, line: 591, type: !77, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "done_on_match", scope: !219, file: !220, line: 606, type: !77, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "exit_on_match", scope: !219, file: !220, line: 607, type: !77, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "matcher", scope: !360, file: !220, line: 1490, type: !26, isLocal: true, isDefinition: true)
!360 = distinct !DISubprogram(name: "setmatcher", scope: !220, file: !220, line: 1488, type: !46, isLocal: true, isDefinition: true, scopeLine: 1489, flags: DIFlagPrototyped, isOptimized: true, unit: !219, variables: !361)
!361 = !{!362, !363}
!362 = !DILocalVariable(name: "m", arg: 1, scope: !360, file: !220, line: 1488, type: !26)
!363 = !DILocalVariable(name: "i", scope: !360, file: !220, line: 1491, type: !157)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "execute", scope: !219, file: !220, line: 395, type: !35, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "prev_digit_optind", scope: !368, file: !220, line: 1621, type: !77, isLocal: true, isDefinition: true)
!368 = distinct !DISubprogram(name: "get_nondigit_option", scope: !220, file: !220, line: 1619, type: !369, isLocal: true, isDefinition: true, scopeLine: 1620, flags: DIFlagPrototyped, isOptimized: true, unit: !219, variables: !373)
!369 = !DISubroutineType(types: !370)
!370 = !{!77, !77, !371, !251}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !384}
!374 = !DILocalVariable(name: "argc", arg: 1, scope: !368, file: !220, line: 1619, type: !77)
!375 = !DILocalVariable(name: "argv", arg: 2, scope: !368, file: !220, line: 1619, type: !371)
!376 = !DILocalVariable(name: "default_context", arg: 3, scope: !368, file: !220, line: 1619, type: !251)
!377 = !DILocalVariable(name: "opt", scope: !368, file: !220, line: 1622, type: !77)
!378 = !DILocalVariable(name: "this_digit_optind", scope: !368, file: !220, line: 1622, type: !77)
!379 = !DILocalVariable(name: "was_digit", scope: !368, file: !220, line: 1622, type: !77)
!380 = !DILocalVariable(name: "buf", scope: !368, file: !220, line: 1623, type: !381)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 544, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 68)
!384 = !DILocalVariable(name: "p", scope: !368, file: !220, line: 1624, type: !76)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "short_options", scope: !219, file: !220, line: 274, type: !10, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "long_options", scope: !219, file: !220, line: 293, type: !389, isLocal: true, isDefinition: true)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 13056, elements: !398)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !392, line: 50, size: 256, elements: !393)
!392 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "/vagrant/grep-2.9/src")
!393 = !{!394, !395, !396, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !391, file: !392, line: 52, baseType: !26, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !391, file: !392, line: 55, baseType: !77, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !391, file: !392, line: 56, baseType: !251, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !391, file: !392, line: 57, baseType: !77, size: 32, offset: 192)
!398 = !{!399}
!399 = !DISubrange(count: 51)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "devices", scope: !219, file: !220, line: 386, type: !222, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "directories_types", scope: !219, file: !220, line: 373, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 96, elements: !104)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "directories_args", scope: !219, file: !220, line: 369, type: !408, isLocal: true, isDefinition: true)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 256, elements: !118)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "directories", scope: !219, file: !220, line: 379, type: !231, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "group_separator", scope: !219, file: !220, line: 90, type: !26, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "label", scope: !219, file: !220, line: 593, type: !76, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "context_match_color", scope: !219, file: !220, line: 138, type: !26, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "selected_match_color", scope: !219, file: !220, line: 137, type: !26, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "color_dict", scope: !219, file: !220, line: 254, type: !422, isLocal: true, isDefinition: true)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 2304, elements: !432)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "color_cap", file: !220, line: 219, size: 192, elements: !424)
!424 = !{!425, !426, !428}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !423, file: !220, line: 221, baseType: !26, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !423, file: !220, line: 222, baseType: !427, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "fct", scope: !423, file: !220, line: 223, baseType: !429, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!26}
!432 = !{!433}
!433 = !DISubrange(count: 12)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "filename_color", scope: !219, file: !220, line: 141, type: !26, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "line_num_color", scope: !219, file: !220, line: 142, type: !26, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "byte_num_color", scope: !219, file: !220, line: 143, type: !26, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "sep_color", scope: !219, file: !220, line: 144, type: !26, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "selected_line_color", scope: !219, file: !220, line: 145, type: !26, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "context_line_color", scope: !219, file: !220, line: 146, type: !26, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "sgr_start", scope: !219, file: !220, line: 205, type: !26, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "sgr_end", scope: !219, file: !220, line: 207, type: !26, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "filename", scope: !219, file: !220, line: 358, type: !26, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "pagesize", scope: !219, file: !220, line: 433, type: !32, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "bufalloc", scope: !219, file: !220, line: 428, type: !32, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "buffer", scope: !219, file: !220, line: 427, type: !76, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "bufdesc", scope: !219, file: !220, line: 430, type: !77, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "totalcc", scope: !219, file: !220, line: 597, type: !462, isLocal: true, isDefinition: true)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !463, line: 112, baseType: !464)
!463 = !DIFile(filename: "/usr/include/stdint.h", directory: "/vagrant/grep-2.9/src")
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !248, line: 62, baseType: !6)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "lastout", scope: !219, file: !220, line: 599, type: !26, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "totalnl", scope: !219, file: !220, line: 602, type: !462, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "pending", scope: !219, file: !220, line: 604, type: !77, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "bufbeg", scope: !219, file: !220, line: 431, type: !76, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "buflim", scope: !219, file: !220, line: 432, type: !76, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "lastnl", scope: !219, file: !220, line: 598, type: !26, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "used", scope: !479, file: !220, line: 897, type: !77, isLocal: true, isDefinition: true)
!479 = distinct !DISubprogram(name: "prtext", scope: !220, file: !220, line: 895, type: !480, isLocal: true, isDefinition: true, scopeLine: 896, flags: DIFlagPrototyped, isOptimized: true, unit: !219, variables: !482)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !26, !26, !251}
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !495}
!483 = !DILocalVariable(name: "beg", arg: 1, scope: !479, file: !220, line: 895, type: !26)
!484 = !DILocalVariable(name: "lim", arg: 2, scope: !479, file: !220, line: 895, type: !26)
!485 = !DILocalVariable(name: "nlinesp", arg: 3, scope: !479, file: !220, line: 895, type: !251)
!486 = !DILocalVariable(name: "bp", scope: !479, file: !220, line: 898, type: !26)
!487 = !DILocalVariable(name: "p", scope: !479, file: !220, line: 898, type: !26)
!488 = !DILocalVariable(name: "eol", scope: !479, file: !220, line: 899, type: !12)
!489 = !DILocalVariable(name: "i", scope: !479, file: !220, line: 900, type: !77)
!490 = !DILocalVariable(name: "n", scope: !479, file: !220, line: 900, type: !77)
!491 = !DILocalVariable(name: "nl", scope: !492, file: !220, line: 930, type: !26)
!492 = distinct !DILexicalBlock(scope: !493, file: !220, line: 929, column: 9)
!493 = distinct !DILexicalBlock(scope: !494, file: !220, line: 908, column: 5)
!494 = distinct !DILexicalBlock(scope: !479, file: !220, line: 907, column: 7)
!495 = !DILocalVariable(name: "nl", scope: !496, file: !220, line: 942, type: !26)
!496 = distinct !DILexicalBlock(scope: !497, file: !220, line: 941, column: 9)
!497 = distinct !DILexicalBlock(scope: !498, file: !220, line: 940, column: 7)
!498 = distinct !DILexicalBlock(scope: !499, file: !220, line: 940, column: 7)
!499 = distinct !DILexicalBlock(scope: !500, file: !220, line: 938, column: 5)
!500 = distinct !DILexicalBlock(scope: !479, file: !220, line: 937, column: 7)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "outleft", scope: !219, file: !220, line: 603, type: !245, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "bufoffset", scope: !219, file: !220, line: 434, type: !245, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "after_last_match", scope: !219, file: !220, line: 435, type: !245, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 4294967295, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!508 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!509 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!510 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!511 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!512 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!513 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!514 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!515 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!516 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!517 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!518 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!519 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!520 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!522 = distinct !DIGlobalVariable(name: "syntax_bits_set", scope: !523, file: !524, line: 522, type: !86, isLocal: true, isDefinition: true)
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !525, retainedTypes: !972, globals: !1034)
!524 = !DIFile(filename: "dfa.c", directory: "/vagrant/grep-2.9/src")
!525 = !{!526, !59, !549, !569, !955, !967}
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !524, line: 141, size: 32, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!528 = !DIEnumerator(name: "END", value: -1)
!529 = !DIEnumerator(name: "EMPTY", value: 256)
!530 = !DIEnumerator(name: "BACKREF", value: 257)
!531 = !DIEnumerator(name: "BEGLINE", value: 258)
!532 = !DIEnumerator(name: "ENDLINE", value: 259)
!533 = !DIEnumerator(name: "BEGWORD", value: 260)
!534 = !DIEnumerator(name: "ENDWORD", value: 261)
!535 = !DIEnumerator(name: "LIMWORD", value: 262)
!536 = !DIEnumerator(name: "NOTLIMWORD", value: 263)
!537 = !DIEnumerator(name: "QMARK", value: 264)
!538 = !DIEnumerator(name: "STAR", value: 265)
!539 = !DIEnumerator(name: "PLUS", value: 266)
!540 = !DIEnumerator(name: "REPMN", value: 267)
!541 = !DIEnumerator(name: "CAT", value: 268)
!542 = !DIEnumerator(name: "OR", value: 269)
!543 = !DIEnumerator(name: "LPAREN", value: 270)
!544 = !DIEnumerator(name: "RPAREN", value: 271)
!545 = !DIEnumerator(name: "ANYCHAR", value: 272)
!546 = !DIEnumerator(name: "MBCSET", value: 273)
!547 = !DIEnumerator(name: "WCHAR", value: 274)
!548 = !DIEnumerator(name: "CSET", value: 275)
!549 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 374, size: 32, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568}
!551 = !DIEnumerator(name: "_REG_ENOSYS", value: -1)
!552 = !DIEnumerator(name: "_REG_NOERROR", value: 0)
!553 = !DIEnumerator(name: "_REG_NOMATCH", value: 1)
!554 = !DIEnumerator(name: "_REG_BADPAT", value: 2)
!555 = !DIEnumerator(name: "_REG_ECOLLATE", value: 3)
!556 = !DIEnumerator(name: "_REG_ECTYPE", value: 4)
!557 = !DIEnumerator(name: "_REG_EESCAPE", value: 5)
!558 = !DIEnumerator(name: "_REG_ESUBREG", value: 6)
!559 = !DIEnumerator(name: "_REG_EBRACK", value: 7)
!560 = !DIEnumerator(name: "_REG_EPAREN", value: 8)
!561 = !DIEnumerator(name: "_REG_EBRACE", value: 9)
!562 = !DIEnumerator(name: "_REG_BADBR", value: 10)
!563 = !DIEnumerator(name: "_REG_ERANGE", value: 11)
!564 = !DIEnumerator(name: "_REG_ESPACE", value: 12)
!565 = !DIEnumerator(name: "_REG_BADRPT", value: 13)
!566 = !DIEnumerator(name: "_REG_EEND", value: 14)
!567 = !DIEnumerator(name: "_REG_ESIZE", value: 15)
!568 = !DIEnumerator(name: "_REG_ERPAREN", value: 16)
!569 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !570, line: 41, size: 32, elements: !571)
!570 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/vagrant/grep-2.9/src")
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954}
!572 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!573 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!574 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!575 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!576 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!577 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!578 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!579 = !DIEnumerator(name: "DAY_1", value: 131079)
!580 = !DIEnumerator(name: "DAY_2", value: 131080)
!581 = !DIEnumerator(name: "DAY_3", value: 131081)
!582 = !DIEnumerator(name: "DAY_4", value: 131082)
!583 = !DIEnumerator(name: "DAY_5", value: 131083)
!584 = !DIEnumerator(name: "DAY_6", value: 131084)
!585 = !DIEnumerator(name: "DAY_7", value: 131085)
!586 = !DIEnumerator(name: "ABMON_1", value: 131086)
!587 = !DIEnumerator(name: "ABMON_2", value: 131087)
!588 = !DIEnumerator(name: "ABMON_3", value: 131088)
!589 = !DIEnumerator(name: "ABMON_4", value: 131089)
!590 = !DIEnumerator(name: "ABMON_5", value: 131090)
!591 = !DIEnumerator(name: "ABMON_6", value: 131091)
!592 = !DIEnumerator(name: "ABMON_7", value: 131092)
!593 = !DIEnumerator(name: "ABMON_8", value: 131093)
!594 = !DIEnumerator(name: "ABMON_9", value: 131094)
!595 = !DIEnumerator(name: "ABMON_10", value: 131095)
!596 = !DIEnumerator(name: "ABMON_11", value: 131096)
!597 = !DIEnumerator(name: "ABMON_12", value: 131097)
!598 = !DIEnumerator(name: "MON_1", value: 131098)
!599 = !DIEnumerator(name: "MON_2", value: 131099)
!600 = !DIEnumerator(name: "MON_3", value: 131100)
!601 = !DIEnumerator(name: "MON_4", value: 131101)
!602 = !DIEnumerator(name: "MON_5", value: 131102)
!603 = !DIEnumerator(name: "MON_6", value: 131103)
!604 = !DIEnumerator(name: "MON_7", value: 131104)
!605 = !DIEnumerator(name: "MON_8", value: 131105)
!606 = !DIEnumerator(name: "MON_9", value: 131106)
!607 = !DIEnumerator(name: "MON_10", value: 131107)
!608 = !DIEnumerator(name: "MON_11", value: 131108)
!609 = !DIEnumerator(name: "MON_12", value: 131109)
!610 = !DIEnumerator(name: "AM_STR", value: 131110)
!611 = !DIEnumerator(name: "PM_STR", value: 131111)
!612 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!613 = !DIEnumerator(name: "D_FMT", value: 131113)
!614 = !DIEnumerator(name: "T_FMT", value: 131114)
!615 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!616 = !DIEnumerator(name: "ERA", value: 131116)
!617 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!618 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!619 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!620 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!621 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!622 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!623 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!624 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!625 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!626 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!627 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!628 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!629 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!630 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!631 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!632 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!633 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!634 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!635 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!636 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!637 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!638 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!639 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!640 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!641 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!642 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!643 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!644 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!645 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!646 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!647 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!648 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!649 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!650 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!651 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!652 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!653 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!654 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!655 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!656 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!657 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!658 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!659 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!660 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!661 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!662 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!663 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!664 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!665 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!666 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!667 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!668 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!669 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!670 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!671 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!672 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!673 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!674 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!675 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!676 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!677 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!678 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!679 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!680 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!681 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!682 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!683 = !DIEnumerator(name: "__ALTMON_1", value: 131183)
!684 = !DIEnumerator(name: "__ALTMON_2", value: 131184)
!685 = !DIEnumerator(name: "__ALTMON_3", value: 131185)
!686 = !DIEnumerator(name: "__ALTMON_4", value: 131186)
!687 = !DIEnumerator(name: "__ALTMON_5", value: 131187)
!688 = !DIEnumerator(name: "__ALTMON_6", value: 131188)
!689 = !DIEnumerator(name: "__ALTMON_7", value: 131189)
!690 = !DIEnumerator(name: "__ALTMON_8", value: 131190)
!691 = !DIEnumerator(name: "__ALTMON_9", value: 131191)
!692 = !DIEnumerator(name: "__ALTMON_10", value: 131192)
!693 = !DIEnumerator(name: "__ALTMON_11", value: 131193)
!694 = !DIEnumerator(name: "__ALTMON_12", value: 131194)
!695 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195)
!696 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196)
!697 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197)
!698 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198)
!699 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199)
!700 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200)
!701 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201)
!702 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202)
!703 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203)
!704 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204)
!705 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205)
!706 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206)
!707 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207)
!708 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208)
!709 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209)
!710 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210)
!711 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211)
!712 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212)
!713 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213)
!714 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214)
!715 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215)
!716 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216)
!717 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217)
!718 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218)
!719 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219)
!720 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220)
!721 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221)
!722 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222)
!723 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223)
!724 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224)
!725 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225)
!726 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226)
!727 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227)
!728 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228)
!729 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229)
!730 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230)
!731 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231)
!732 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!733 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!734 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!735 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!736 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!737 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!738 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!739 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!740 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!741 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!742 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!743 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!744 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!745 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!746 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!747 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!748 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!749 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!750 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!751 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!752 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!753 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!754 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!755 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!756 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!757 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!758 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!759 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!760 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!761 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!762 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!763 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!764 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!765 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!766 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!767 = !DIEnumerator(name: "CODESET", value: 14)
!768 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!769 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!770 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!771 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!772 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!773 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!774 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!775 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!776 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!777 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!778 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!779 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!780 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!781 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!782 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!783 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!784 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!785 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!786 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!787 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!788 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!789 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!790 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!791 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!792 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!793 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!794 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!795 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!796 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!797 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!798 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!799 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!800 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!801 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!802 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!803 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!804 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!805 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!806 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!807 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!808 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!809 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!810 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!811 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!812 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!813 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!814 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!815 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!816 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!817 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!818 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!819 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!820 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!821 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!822 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!823 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!824 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!825 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!826 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!827 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!828 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!829 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!830 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!831 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!832 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!833 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!834 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!835 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!836 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!837 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!838 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!839 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!840 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!841 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!842 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!843 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!844 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!845 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!846 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!847 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!848 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!849 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!850 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!851 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!852 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!853 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!854 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!855 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!856 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!857 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!858 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!859 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!860 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!861 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!862 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!863 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!864 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!865 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!866 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!867 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!868 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!869 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!870 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!871 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!872 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!873 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!874 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!875 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!876 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!877 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!878 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!879 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!880 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!881 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!882 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!883 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!884 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!885 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!886 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!887 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!888 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!889 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!890 = !DIEnumerator(name: "THOUSEP", value: 65537)
!891 = !DIEnumerator(name: "__GROUPING", value: 65538)
!892 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!893 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!894 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!895 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!896 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!897 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!898 = !DIEnumerator(name: "__YESSTR", value: 327682)
!899 = !DIEnumerator(name: "__NOSTR", value: 327683)
!900 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!901 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!902 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!903 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!904 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!905 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!906 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!907 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!908 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!909 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!910 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!911 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!912 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!913 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!914 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!915 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!916 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!917 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!918 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!919 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!920 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!921 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!922 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!923 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!924 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!925 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!926 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!927 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!928 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!929 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!930 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!931 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!932 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!933 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!934 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!935 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!936 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!937 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!938 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!939 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!940 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!941 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!942 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!943 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!944 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!945 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!946 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!947 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!948 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!949 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!950 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!951 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!952 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!953 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!954 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!955 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !957, file: !956, line: 203, size: 32, elements: !965)
!956 = !DIFile(filename: "../lib/xalloc.h", directory: "/vagrant/grep-2.9/src")
!957 = distinct !DISubprogram(name: "x2nrealloc", scope: !956, file: !956, line: 191, type: !958, isLocal: true, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: true, unit: !523, variables: !960)
!958 = !DISubroutineType(types: !959)
!959 = !{!75, !75, !39, !32}
!960 = !{!961, !962, !963, !964}
!961 = !DILocalVariable(name: "p", arg: 1, scope: !957, file: !956, line: 191, type: !75)
!962 = !DILocalVariable(name: "pn", arg: 2, scope: !957, file: !956, line: 191, type: !39)
!963 = !DILocalVariable(name: "s", arg: 3, scope: !957, file: !956, line: 191, type: !32)
!964 = !DILocalVariable(name: "n", scope: !957, file: !956, line: 193, type: !32)
!965 = !{!966}
!966 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 64)
!967 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !524, line: 2799, size: 32, elements: !968)
!968 = !{!969, !970, !971}
!969 = !DIEnumerator(name: "TRANSIT_STATE_IN_PROGRESS", value: 0)
!970 = !DIEnumerator(name: "TRANSIT_STATE_DONE", value: 1)
!971 = !DIEnumerator(name: "TRANSIT_STATE_END_BUFFER", value: 2)
!972 = !{!251, !973, !979, !985, !77, !79, !208, !148, !997, !26, !76, !999, !1004, !1006, !78, !6, !157, !1014, !250, !998, !32, !1025, !1026, !75, !1028}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "position", file: !524, line: 238, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !524, line: 234, size: 64, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !975, file: !524, line: 236, baseType: !157, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "constraint", scope: !975, file: !524, line: 237, baseType: !157, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "position_set", file: !524, line: 245, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !524, line: 241, size: 128, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !981, file: !524, line: 243, baseType: !973, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "nelem", scope: !981, file: !524, line: 244, baseType: !77, size: 32, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "dfa_state", file: !524, line: 265, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !524, line: 250, size: 384, elements: !988)
!988 = !{!989, !990, !991, !992, !993, !994, !995, !996}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !987, file: !524, line: 252, baseType: !77, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !987, file: !524, line: 253, baseType: !980, size: 128, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "newline", scope: !987, file: !524, line: 254, baseType: !12, size: 8, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "letter", scope: !987, file: !524, line: 255, baseType: !12, size: 8, offset: 200)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "backref", scope: !987, file: !524, line: 256, baseType: !12, size: 8, offset: 208)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "constraint", scope: !987, file: !524, line: 257, baseType: !78, size: 8, offset: 216)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "first_end", scope: !987, file: !524, line: 258, baseType: !77, size: 32, offset: 224)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "mbps", scope: !987, file: !524, line: 260, baseType: !980, size: 128, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !33, line: 90, baseType: !77)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "charclass", file: !524, line: 87, baseType: !1001)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 256, elements: !1002)
!1002 = !{!1003}
!1003 = !DISubrange(count: 8)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "token", file: !524, line: 227, baseType: !526)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mb_char_classes", file: !524, line: 270, size: 768, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012, !1013, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "cset", scope: !1007, file: !524, line: 272, baseType: !77, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1007, file: !524, line: 273, baseType: !77, size: 32, offset: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !1007, file: !524, line: 274, baseType: !997, size: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "nchars", scope: !1007, file: !524, line: 275, baseType: !77, size: 32, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ch_classes", scope: !1007, file: !524, line: 276, baseType: !1014, size: 64, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !1016, line: 38, baseType: !6)
!1016 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/wctype-wchar.h", directory: "/vagrant/grep-2.9/src")
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "nch_classes", scope: !1007, file: !524, line: 277, baseType: !77, size: 32, offset: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "range_sts", scope: !1007, file: !524, line: 278, baseType: !997, size: 64, offset: 320)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "range_ends", scope: !1007, file: !524, line: 279, baseType: !997, size: 64, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "nranges", scope: !1007, file: !524, line: 280, baseType: !77, size: 32, offset: 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "equivs", scope: !1007, file: !524, line: 281, baseType: !250, size: 64, offset: 512)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "nequivs", scope: !1007, file: !524, line: 282, baseType: !77, size: 32, offset: 576)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "coll_elems", scope: !1007, file: !524, line: 283, baseType: !250, size: 64, offset: 640)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ncoll_elems", scope: !1007, file: !524, line: 284, baseType: !77, size: 32, offset: 704)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1027, line: 20, baseType: !157)
!1027 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "/vagrant/grep-2.9/src")
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dfamust", file: !139, line: 27, size: 192, elements: !1030)
!1030 = !{!1031, !1032, !1033}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !1029, file: !139, line: 29, baseType: !77, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "must", scope: !1029, file: !139, line: 30, baseType: !76, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1029, file: !139, line: 31, baseType: !1028, size: 64, offset: 128)
!1034 = !{!1035, !1121, !1123, !1125, !1151, !1153, !1155, !1157, !1158, !1160, !1162, !1164, !1166, !1168, !1170, !1172, !1174, !1189, !1191, !1193, !1195, !1197, !1199, !1201, !1203, !1205, !1207, !1209, !1392, !1397, !1402, !1418, !1459}
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(name: "letters", scope: !1037, file: !524, line: 2372, type: !1000, isLocal: true, isDefinition: true)
!1037 = distinct !DISubprogram(name: "dfastate", scope: !524, file: !524, line: 2360, type: !1038, isLocal: false, isDefinition: true, scopeLine: 2361, flags: DIFlagPrototyped, isOptimized: true, unit: !523, variables: !1075)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{null, !77, !1040, !251}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dfa", file: !524, line: 289, size: 1472, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "charclasses", scope: !1041, file: !524, line: 292, baseType: !999, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "cindex", scope: !1041, file: !524, line: 293, baseType: !77, size: 32, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "calloc", scope: !1041, file: !524, line: 294, baseType: !77, size: 32, offset: 96)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !1041, file: !524, line: 297, baseType: !1004, size: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "tindex", scope: !1041, file: !524, line: 298, baseType: !77, size: 32, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "talloc", scope: !1041, file: !524, line: 299, baseType: !77, size: 32, offset: 224)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1041, file: !524, line: 300, baseType: !77, size: 32, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "nleaves", scope: !1041, file: !524, line: 303, baseType: !77, size: 32, offset: 288)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nregexps", scope: !1041, file: !524, line: 304, baseType: !77, size: 32, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !1041, file: !524, line: 306, baseType: !157, size: 32, offset: 352)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_anychar_classes", scope: !1041, file: !524, line: 307, baseType: !1054, size: 160, offset: 384)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 160, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 5)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nmultibyte_prop", scope: !1041, file: !524, line: 328, baseType: !77, size: 32, offset: 544)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "multibyte_prop", scope: !1041, file: !524, line: 329, baseType: !251, size: 64, offset: 576)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "mbcsets", scope: !1041, file: !524, line: 332, baseType: !1006, size: 64, offset: 640)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "nmbcsets", scope: !1041, file: !524, line: 333, baseType: !77, size: 32, offset: 704)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "mbcsets_alloc", scope: !1041, file: !524, line: 334, baseType: !77, size: 32, offset: 736)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !1041, file: !524, line: 337, baseType: !985, size: 64, offset: 768)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "sindex", scope: !1041, file: !524, line: 338, baseType: !77, size: 32, offset: 832)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "salloc", scope: !1041, file: !524, line: 339, baseType: !77, size: 32, offset: 864)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "follows", scope: !1041, file: !524, line: 342, baseType: !979, size: 64, offset: 896)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "searchflag", scope: !1041, file: !524, line: 349, baseType: !77, size: 32, offset: 960)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "tralloc", scope: !1041, file: !524, line: 358, baseType: !77, size: 32, offset: 992)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "trcount", scope: !1041, file: !524, line: 360, baseType: !77, size: 32, offset: 1024)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "trans", scope: !1041, file: !524, line: 362, baseType: !1025, size: 64, offset: 1088)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "realtrans", scope: !1041, file: !524, line: 367, baseType: !1025, size: 64, offset: 1152)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !1041, file: !524, line: 369, baseType: !1025, size: 64, offset: 1216)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "success", scope: !1041, file: !524, line: 371, baseType: !251, size: 64, offset: 1280)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "newlines", scope: !1041, file: !524, line: 373, baseType: !251, size: 64, offset: 1344)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "musts", scope: !1041, file: !524, line: 380, baseType: !1028, size: 64, offset: 1408)
!1075 = !{!1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1110, !1111}
!1076 = !DILocalVariable(name: "s", arg: 1, scope: !1037, file: !524, line: 2360, type: !77)
!1077 = !DILocalVariable(name: "d", arg: 2, scope: !1037, file: !524, line: 2360, type: !1040)
!1078 = !DILocalVariable(name: "trans", arg: 3, scope: !1037, file: !524, line: 2360, type: !251)
!1079 = !DILocalVariable(name: "grps", scope: !1037, file: !524, line: 2362, type: !979)
!1080 = !DILocalVariable(name: "labels", scope: !1037, file: !524, line: 2363, type: !999)
!1081 = !DILocalVariable(name: "ngrps", scope: !1037, file: !524, line: 2364, type: !77)
!1082 = !DILocalVariable(name: "pos", scope: !1037, file: !524, line: 2365, type: !974)
!1083 = !DILocalVariable(name: "matches", scope: !1037, file: !524, line: 2366, type: !1000)
!1084 = !DILocalVariable(name: "matchesf", scope: !1037, file: !524, line: 2367, type: !77)
!1085 = !DILocalVariable(name: "intersect", scope: !1037, file: !524, line: 2368, type: !1000)
!1086 = !DILocalVariable(name: "intersectf", scope: !1037, file: !524, line: 2369, type: !77)
!1087 = !DILocalVariable(name: "leftovers", scope: !1037, file: !524, line: 2370, type: !1000)
!1088 = !DILocalVariable(name: "leftoversf", scope: !1037, file: !524, line: 2371, type: !77)
!1089 = !DILocalVariable(name: "follows", scope: !1037, file: !524, line: 2374, type: !980)
!1090 = !DILocalVariable(name: "tmp", scope: !1037, file: !524, line: 2375, type: !980)
!1091 = !DILocalVariable(name: "state", scope: !1037, file: !524, line: 2376, type: !77)
!1092 = !DILocalVariable(name: "wants_newline", scope: !1037, file: !524, line: 2377, type: !77)
!1093 = !DILocalVariable(name: "state_newline", scope: !1037, file: !524, line: 2378, type: !77)
!1094 = !DILocalVariable(name: "wants_letter", scope: !1037, file: !524, line: 2379, type: !77)
!1095 = !DILocalVariable(name: "state_letter", scope: !1037, file: !524, line: 2380, type: !77)
!1096 = !DILocalVariable(name: "next_isnt_1st_byte", scope: !1037, file: !524, line: 2383, type: !77)
!1097 = !DILocalVariable(name: "i", scope: !1037, file: !524, line: 2385, type: !77)
!1098 = !DILocalVariable(name: "j", scope: !1037, file: !524, line: 2385, type: !77)
!1099 = !DILocalVariable(name: "k", scope: !1037, file: !524, line: 2385, type: !77)
!1100 = !DILocalVariable(name: "match", scope: !1101, file: !524, line: 2478, type: !77)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !524, line: 2476, column: 13)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !524, line: 2475, column: 11)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !524, line: 2475, column: 11)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !524, line: 2457, column: 9)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !524, line: 2456, column: 7)
!1106 = distinct !DILexicalBlock(scope: !1107, file: !524, line: 2456, column: 7)
!1107 = distinct !DILexicalBlock(scope: !1108, file: !524, line: 2403, column: 5)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !524, line: 2402, column: 3)
!1109 = distinct !DILexicalBlock(scope: !1037, file: !524, line: 2402, column: 3)
!1110 = !DILocalVariable(name: "label", scope: !1101, file: !524, line: 2478, type: !77)
!1111 = !DILocalVariable(name: "c", scope: !1112, file: !524, line: 2637, type: !77)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !524, line: 2636, column: 13)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !524, line: 2635, column: 15)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !524, line: 2634, column: 9)
!1115 = distinct !DILexicalBlock(scope: !1116, file: !524, line: 2634, column: 9)
!1116 = distinct !DILexicalBlock(scope: !1117, file: !524, line: 2633, column: 7)
!1117 = distinct !DILexicalBlock(scope: !1118, file: !524, line: 2633, column: 7)
!1118 = distinct !DILexicalBlock(scope: !1119, file: !524, line: 2553, column: 5)
!1119 = distinct !DILexicalBlock(scope: !1120, file: !524, line: 2552, column: 3)
!1120 = distinct !DILexicalBlock(scope: !1037, file: !524, line: 2552, column: 3)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(name: "newline", scope: !1037, file: !524, line: 2373, type: !1000, isLocal: true, isDefinition: true)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(name: "initialized", scope: !1037, file: !524, line: 2381, type: !77, isLocal: true, isDefinition: true)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(name: "sbit", scope: !1127, file: !524, line: 3249, type: !1148, isLocal: true, isDefinition: true)
!1127 = distinct !DISubprogram(name: "dfaexec", scope: !524, file: !524, line: 3240, type: !1128, isLocal: false, isDefinition: true, scopeLine: 3242, flags: DIFlagPrototyped, isOptimized: true, unit: !523, variables: !1130)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!76, !1040, !26, !76, !77, !251, !251}
!1130 = !{!1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145}
!1131 = !DILocalVariable(name: "d", arg: 1, scope: !1127, file: !524, line: 3240, type: !1040)
!1132 = !DILocalVariable(name: "begin", arg: 2, scope: !1127, file: !524, line: 3240, type: !26)
!1133 = !DILocalVariable(name: "end", arg: 3, scope: !1127, file: !524, line: 3240, type: !76)
!1134 = !DILocalVariable(name: "newline", arg: 4, scope: !1127, file: !524, line: 3241, type: !77)
!1135 = !DILocalVariable(name: "count", arg: 5, scope: !1127, file: !524, line: 3241, type: !251)
!1136 = !DILocalVariable(name: "backref", arg: 6, scope: !1127, file: !524, line: 3241, type: !251)
!1137 = !DILocalVariable(name: "s", scope: !1127, file: !524, line: 3243, type: !77)
!1138 = !DILocalVariable(name: "s1", scope: !1127, file: !524, line: 3243, type: !77)
!1139 = !DILocalVariable(name: "tmp", scope: !1127, file: !524, line: 3243, type: !77)
!1140 = !DILocalVariable(name: "p", scope: !1127, file: !524, line: 3244, type: !208)
!1141 = !DILocalVariable(name: "trans", scope: !1127, file: !524, line: 3245, type: !1025)
!1142 = !DILocalVariable(name: "t", scope: !1127, file: !524, line: 3245, type: !251)
!1143 = !DILocalVariable(name: "eol", scope: !1127, file: !524, line: 3247, type: !78)
!1144 = !DILocalVariable(name: "saved_end", scope: !1127, file: !524, line: 3248, type: !78)
!1145 = !DILocalVariable(name: "i", scope: !1146, file: !524, line: 3254, type: !157)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !524, line: 3253, column: 5)
!1147 = distinct !DILexicalBlock(scope: !1127, file: !524, line: 3252, column: 7)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 8192, elements: !1149)
!1149 = !{!1150}
!1150 = !DISubrange(count: 256)
